app/Controllers/CategoryController.php

    public function index()
    {
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `category`

    public function create()
    {
        $rules = [
            'name'            => 'required|is_unique[category.name]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }
        $post = $this->request->getPost(['name']);

        $categoryModel = new CategoryModel();
        $categoryModel->insert([
            'name'            => trim($post['name']),

        ]);
---
INSERT INTO `category` (`name`) VALUES ('Tecnologia')