app/Controllers/ProductController.php

SELECT *
FROM `category`
---
    public function insert()
    {

        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();

INSERT INTO `products` (`name`, `price`, `quantity`, `category_id`, `description`) VALUES ('Kamasutra', '7.50', '20', '1', 'dsfasd a dfasdf')
---
    public function create()
    {
        $rules = [
            'name'            => 'required',
            'price'           => 'required|decimal',
            'quantity'         => 'required|is_natural_no_zero',
            'category_id'         => 'required',
            'description'     => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }
        $post = $this->request->getPost(['name', 'price', 'quantity', 'category_id', 'description']);

        $productModel = new ProductsModel();
        $productModel->insert([
            'name'            => trim($post['name']),
            'price'           => trim($post['price']),
            'quantity' => $post['quantity'],
            'category_id'         => $post['category_id'],
            'description'  => $post['description'],
        ]);