app/Models/OrdersModel.php

    public function getOrders($page, $perPage)
    {
        return $this->select('orders.*, users.email')
                    ->join('users', 'orders.user_id = users.id')
                   ->orderBy('orders.id_order', 'DESC')
                   ->limit($perPage, $perPage * ($page - 1))
                   ->findAll();
---
SELECT `orders`.*, `users`.`email`
FROM `orders`
JOIN `users` ON `orders`.`user_id` = `users`.`id`
ORDER BY `orders`.`id_order` DESC
 LIMIT 12

    public function totalOrders(){
        return $this->db->table('orders')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`