app/Models/ProductsModel.php

SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function totalProducts(){
        return $this->db->table('products')->countAllResults();

SELECT `products`.*, `category`.`name` AS `category`
FROM `products`
JOIN `category` ON `products`.`category_id`= `category`.`id`
ORDER BY `products`.`id` DESC
 LIMIT 12
---
    public function getProducts($page, $perPage)
{
    return $this->select('products.*, category.name AS category')
               ->join('category', 'products.category_id= category.id')
               ->orderBy('products.id', 'DESC')
               ->limit($perPage, $perPage * ($page - 1))
               ->findAll();