app/Models/UsersModel.php

    public function userAddress()
    {
        return $this->select('users.*, addresses.street AS street, addresses.city, addresses.cap')
            ->join('addresses', 'users.address_id= addresses.address_id')
            ->findAll();
---
SELECT `users`.*, `addresses`.`street` AS `street`, `addresses`.`city`, `addresses`.`cap`
FROM `users`
JOIN `addresses` ON `users`.`address_id`= `addresses`.`address_id`

    public function userAddressById($id)
    {
        return $this->select('users.*, addresses.street AS street, addresses.city, addresses.cap')
            ->join('addresses', 'users.address_id= addresses.address_id')
            ->where('users.id', $id)
            ->first();
---
SELECT `users`.*, `addresses`.`street` AS `street`, `addresses`.`city`, `addresses`.`cap`
FROM `users`
JOIN `addresses` ON `users`.`address_id`= `addresses`.`address_id`
WHERE `users`.`id` = '2'
 LIMIT 1